NOT_STRICT = "нестрого"

NO_BASE_CHANNEL_MSG = "❌ Не найден голосовой канал, из которого распределяются пользователи."
NO_TEAM_A_CHANNEL_MSG = "❌ Не найден голосовой канал, в который нужно распределить участников первой команды."
NO_TEAM_B_CHANNEL_MSG = "❌ Не найден голосовой канал, в который нужно распределить участников второй команды."
TEAM_GT_USERS_MSG = "❌ Невозможно распределить участников выбранным способом: " \
    "количество пользователей меньше количества участников команды."
CANT_DIVIDE_STRICT_MSG = "❌ Невозможно поделить участников строго поровну. Деление не будет производиться."
STRICT_DIVISION_MSG = "🧱 Участники будут поделены строго поровну."
NONSTRICT_DIVISION_MSG = "🧲 Деление будет производиться по остаточному принципу. " \
    "Возможно, одна из команд не досчитается игроков :("
MISSING_ROLE_MSG = "🧿 У вас нет необходимой роли для вызова Сплинтера."
